app/controllers/items_controller.rb

INSERT INTO "items" ("name", "condition", "quantity", "photo_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "GA THing"], ["condition", "Poor"], ["quantity", 2], ["photo_url", ""]]
---
def create
  @item = Item.create!(item_params)

SELECT  "items".* FROM "items" WHERE (#<Item::ActiveRecord_Relation:0x007fca78e542b0>) LIMIT 1
---
def edit
  @user = User.find_by(session[:user_id])
  @item = Item.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "items" SET "name" = $1, "condition" = $2, "quantity" = $3, "photo_url" = $4 WHERE "items"."id" = $5  [["name", "blah blah"], ["condition", "Poor"], ["quantity", 0], ["photo_url", ""], ["id", 8]]
---
def update
  @user = User.find_by(session[:user_id])
  @item = Item.find(params[:id])
  @item.update(item_params)