app/controllers/rentals_controller.rb

def index
  @user = User.find(current_user)
  @rental = Rental.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "rentals".* FROM "rentals" LIMIT 1

def all
  @user = User.find_by(session[:user_id])
  @rental = Rental.all.order('created_at DESC')
---
SELECT "rentals".* FROM "rentals"  ORDER BY created_at DESC

def show
  @user = User.find(current_user)
  @rental = Rental.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT 1  [["id", 1]]

def create
    @user = User.find_by(session[:user_id])
    @rental = @user.rentals.create!(rental_params)
    @rental.user = current_user
    if @rental.save
---
INSERT INTO "rentals" ("name", "type", "email", "phone", "item", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "asdfa"], ["type", ""], ["email", ""], ["phone", ""], ["item", ""], ["user_id", 1], ["created_at", "2015-08-11 16:57:32.177672"], ["updated_at", "2015-08-11 16:57:32.177672"]]
UPDATE "rentals" SET "user_id" = $1, "updated_at" = $2 WHERE "rentals"."id" = $3  [["user_id", 1], ["updated_at", "2015-08-11 21:09:18.117374"], ["id", 4]]

def edit
  @items = Item.all
  @user = User.find_by(session[:user_id])
  @rental = Rental.find(params[:id])
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT 1  [["id", 2]]

def update
  @user = User.find_by(session[:user_id])
  @rental = Rental.find(params[:id])
  authorize! :update, @rental
  @rental.update(rental_params)
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "rentals" SET "staff" = $1, "email" = $2, "phone" = $3, "updated_at" = $4 WHERE "rentals"."id" = $5  [["staff", "Student"], ["email", "jimmy@gmail.com"], ["phone", "745-454-5445"], ["updated_at", "2015-08-12 02:16:08.552551"], ["id", 2]]

def destroy
  @user = User.find_by(session[:user_id])
  @rental = Rental.find(params[:id])
  authorize! :destroy, @rental
  @rental.destroy
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "rentals" WHERE "rentals"."id" = $1  [["id", 4]]